
&После("ПриСозданииНаСервере")
Процедура МС_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка)
	
	МС_ДобавитьКомандыСинхронизации(Форма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#Область МенеджерСинхронизаций

// Команды запуска синхронизации
Процедура МС_ДобавитьКомандыСинхронизации(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ПараметрыПоиска = Новый Структура("ИмяФормы", Форма.ИмяФормы);
	ПодключаемыеСинхронизации = МС_СинхронизацияСервер.ПодключаемыеКомандыСинхронизации(ПараметрыПоиска);
	
	Если ПодключаемыеСинхронизации = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ПодключаемыеСинхронизации.Количество() > 0 Тогда
		
		ЭлементКоманднаяПанель = Форма.Элементы.Найти("СписокКоманднаяПанель");
		
		Если ЭлементКоманднаяПанель = Неопределено Тогда
			ЭлементКоманднаяПанель = Форма.Элементы.Найти("СписокДокументыЗакупкиКоманднаяПанель");
		КонецЕсли;
		
		Если ЭлементКоманднаяПанель = Неопределено Тогда
			ЭлементКоманднаяПанель = Форма.Элементы.Найти("СписокДокументыПродажиКоманднаяПанель");
		КонецЕсли;
		
		Если ЭлементКоманднаяПанель = Неопределено Тогда
			ЭлементКоманднаяПанель = Форма.Элементы.Найти("КоманднаяПанельСписокРасширенныйПоискНоменклатура");
		КонецЕсли;
		
		Если ЭлементКоманднаяПанель = Неопределено Тогда
			ЭлементКоманднаяПанель = Форма.Элементы.Найти("СписокДокументыПоступленияКоманднаяПанель");
		КонецЕсли;
		
		Если ЭлементКоманднаяПанель = Неопределено Тогда
			ЭлементКоманднаяПанель = Форма.Элементы.Найти("ФормаКоманднаяПанель");
		КонецЕсли;
		
		Если ЭлементКоманднаяПанель <> Неопределено
			И ЭлементКоманднаяПанель.ПодчиненныеЭлементы.Количество() = 0 Тогда
			ЭлементКоманднаяПанель = Форма.Элементы.Найти("ФормаКоманднаяПанель");
		КонецЕсли;
			
		Если ЭлементКоманднаяПанель <> Неопределено Тогда
			
			НовоеПодменю = Форма.Элементы.Добавить("МС_МенеджерСинхронизаций", Тип("ГруппаФормы"), ЭлементКоманднаяПанель);
			НовоеПодменю.Вид = ВидГруппыФормы.Подменю;
			НовоеПодменю.Заголовок = МС_СинхронизацияКлиентСервер.ЗаголовокГруппыКомандСинхронизации();
			НовоеПодменю.Картинка = БиблиотекаКартинок.МС_МенеджерСинхронизаций;
	
			НомерКоманды = 0;
			
			Для Каждого СтрокаСинхронизации Из ПодключаемыеСинхронизации Цикл
				
				НомерКоманды = НомерКоманды + 1;
				
				ИмяКоманды = МС_СинхронизацияКлиентСервер.ИмяКомандыСинхронизации() + "_" + СтрокаСинхронизации.КодНастройки + "_" + СтрокаСинхронизации.НомерСтроки;
				
				ИмяКоманды = ИмяКоманды + "_" + ?(СтрокаСинхронизации.ИнтерактивнаяЗагрузка = Истина, "1", "0");
				
				НоваяКоманда = Форма.Команды.Добавить(ИмяКоманды);
				НоваяКоманда.Действие = "Подключаемый_ВыполнитьПереопределяемуюКоманду";
				НоваяКоманда.Заголовок = СтрокаСинхронизации.НаименованиеЗагрузки;
				НоваяКоманда.ИзменяетСохраняемыеДанные = Ложь;
				НоваяКоманда.Отображение = ОтображениеКнопки.Авто;
				НоваяКоманда.Подсказка = СтрокаСинхронизации.НаименованиеЗагрузки;
				
				НовыйЭлемент = Форма.Элементы.Вставить(МС_СинхронизацияКлиентСервер.ИмяКомандыСинхронизации() + НомерКоманды, Тип("КнопкаФормы"), Форма.Элементы.МС_МенеджерСинхронизаций);
				НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
				НовыйЭлемент.ИмяКоманды = ИмяКоманды;
				
				Если СтрокаСинхронизации.ИнтерактивнаяЗагрузка = Ложь Тогда
					
					// Команда загрузки выделенных строк не добавляется для интерактивной загрузки.
					ИмяКоманды = МС_СинхронизацияКлиентСервер.ИмяКомандыСинхронизацииВыделенныхСтрок() + "_" + СтрокаСинхронизации.КодНастройки + "_" + СтрокаСинхронизации.НомерСтроки;
					
					ИмяКоманды = ИмяКоманды + "_" + ?(СтрокаСинхронизации.ИнтерактивнаяЗагрузка = Истина, "1", "0");
					
					НоваяКоманда = Форма.Команды.Добавить(ИмяКоманды);
					НоваяКоманда.Действие = "Подключаемый_ВыполнитьПереопределяемуюКоманду";
					НоваяКоманда.Заголовок = СтрокаСинхронизации.НаименованиеЗагрузки + " выделенных строк";
					НоваяКоманда.ИзменяетСохраняемыеДанные = Ложь;
					НоваяКоманда.Отображение = ОтображениеКнопки.Авто;
					НоваяКоманда.Подсказка = СтрокаСинхронизации.НаименованиеЗагрузки + " выделенных строк";
					
					НовыйЭлемент = Форма.Элементы.Вставить(МС_СинхронизацияКлиентСервер.ИмяКомандыСинхронизацииВыделенныхСтрок() + "_" + НомерКоманды, Тип("КнопкаФормы"), Форма.Элементы.МС_МенеджерСинхронизаций);
					НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
					НовыйЭлемент.ИмяКоманды = ИмяКоманды;
					
				КонецЕсли; 
				
				
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
