
&После("ВыполнитьПереопределяемуюКоманду")
Процедура МС_ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры)
	
	ПараметрыЗагрузки = МС_ПараметрыВыполняемойКоманды(Команда.Имя);
	
	Если ПараметрыЗагрузки.СинхронизацииВыделенныхСтрок Тогда
		
		Если Форма.Элементы.Найти("Список") <> Неопределено Тогда
			ЭлементСписок = Форма.Элементы.Найти("Список");
		ИначеЕсли Форма.Элементы.Найти("СписокРасширенныйПоискНоменклатура") <> Неопределено Тогда
			ЭлементСписок = Форма.Элементы.Найти("СписокРасширенныйПоискНоменклатура");
		ИначеЕсли Форма.Элементы.Найти("СписокДокументыПродажи") <> Неопределено Тогда
			ЭлементСписок = Форма.Элементы.Найти("СписокДокументыПродажи");
		Иначе
			ВызватьИсключение("Не найден Элемент список на форме");
		КонецЕсли;
		
		ПараметрыЗагрузки.Вставить("МассивСсылок", ЭлементСписок.ВыделенныеСтроки);
		
	КонецЕсли;
	
	Если ПараметрыЗагрузки.ИнтерактивнаяЗагрука Тогда
		// Интерактивная загрузка
		МС_СинхронизацияКлиент.ВыполнитьИнтерактивныйОбменДаннымиОбработкаКоманды(ПараметрыЗагрузки, Форма);
	Иначе
		// Фоновая загрузка
		МС_СинхронизацияКлиент.ВыполнитьОбменДаннымиОбработкаКоманды(ПараметрыЗагрузки, Форма);
	КонецЕсли; 
	
КонецПроцедуры                                                                                                                                                                                                                           	

// Возвращает структуру параметров выполняемой команды синхронизации из имени команды
//
// Параметры:
//  ИмяВыполняемойКоманды  - Строка - имя выполняемой команды синхронизации
//
// Возвращаемое значение:
//   Структура   - Структура выполняемой команды синхронизации
//
Функция МС_ПараметрыВыполняемойКоманды(Знач ИмяВыполняемойКоманды)
	
	ПараметрыЗагрузки = Новый Структура;
	
	Если СтрНайти(ИмяВыполняемойКоманды, МС_СинхронизацияКлиентСервер.ИмяКомандыСинхронизацииВыделенныхСтрок()) = 1 Тогда
		ПараметрыЗагрузки.Вставить("СинхронизацииВыделенныхСтрок", Истина);
		ИмяВыполняемойКоманды = СтрЗаменить(ИмяВыполняемойКоманды, 
		МС_СинхронизацияКлиентСервер.ИмяКомандыСинхронизацииВыделенныхСтрок() + "_", "");
	ИначеЕсли СтрНайти(ИмяВыполняемойКоманды, МС_СинхронизацияКлиентСервер.ИмяКомандыСинхронизации()) = 1 Тогда
		ПараметрыЗагрузки.Вставить("СинхронизацииВыделенныхСтрок", Ложь);
		ИмяВыполняемойКоманды = СтрЗаменить(ИмяВыполняемойКоманды, 
		МС_СинхронизацияКлиентСервер.ИмяКомандыСинхронизации() + "_", "");
	Иначе
		ВызватьИсключение("Попытка выполнить непредусмотренную команду синхронизации (МС)");
	КонецЕсли;
	
	МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяВыполняемойКоманды, "_");
	
	ПараметрыЗагрузки.Вставить("КодНастройки", МассивСтрок[0]);
	ПараметрыЗагрузки.Вставить("НомерСтрокиНастройки", МассивСтрок[1]);
	ПараметрыЗагрузки.Вставить("ИнтерактивнаяЗагрука", МассивСтрок[2] = 1);
	
	Возврат ПараметрыЗагрузки;
	
КонецФункции
