
Функция ИмяКомандыСинхронизации() Экспорт
	Возврат "МС_ВыполнитьСинхронизацию";
КонецФункции

Функция ИмяКомандыСинхронизацииВыделенныхСтрок() Экспорт
	Возврат "МС_ВыполнитьСинхронизациюВыделенныхСтрок";
КонецФункции

Функция ЗаголовокГруппыКомандСинхронизации() Экспорт
	Возврат "Синхронизация (МС)";
КонецФункции

Функция МассивСтруктурИзТаблицы(ТаблицаДляМассива, МассивКолонок = Неопределено) Экспорт

	МассивИзТаблицы = Новый Массив;
	
	Для каждого СтрокаТаблицы Из ТаблицаДляМассива Цикл
		
		СтруктураСтроки = Новый Структура;
		
		Если МассивКолонок = Неопределено Тогда
			
			Для каждого КолонкаТаблицы Из ТаблицаДляМассива.Колонки Цикл
			
				СтруктураСтроки.Вставить(КолонкаТаблицы.Имя, СтрокаТаблицы[КолонкаТаблицы.Имя]);
			
			КонецЦикла;
			
		Иначе 
			
			Для каждого КолонкаТаблицы Из МассивКолонок Цикл
			
				СтруктураСтроки.Вставить(КолонкаТаблицы, СтрокаТаблицы[КолонкаТаблицы]);
			
			КонецЦикла; 
		
		КонецЕсли; 
		
		МассивИзТаблицы.Добавить(СтруктураСтроки);
	
	КонецЦикла; 
	
	Возврат МассивИзТаблицы;

КонецФункции
