Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Спр.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.МС_НастройкиAPI КАК Спр
	|ГДЕ
	|	Спр.ВерсияAPI = &ВерсияAPI
	|	И Спр.ИмяШаблонаURL = &ИмяШаблонаURL
	|	И Спр.HTTPМетод = &HTTPМетод
	|	И Спр.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("ВерсияAPI", ВерсияAPI);
	Запрос.УстановитьПараметр("ИмяШаблонаURL", ИмяШаблонаURL);
	Запрос.УстановитьПараметр("HTTPМетод", HTTPМетод);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Отказ = Истина;
		ВызватьИсключение "Запись с такой комбинацией версии API, имени шаблона URL и HTTP-метода уже существует.";
	КонецЕсли;
	
КонецПроцедуры
