
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДлительнаяОперация = ВыполнениеСинхронизацииВДлительнойОперации();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Вставить("ВыводитьОкноОжидания", Ложь);
	ОписаниеОповещения = Новый ОписаниеОповещения("СинхронизацияЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ВыполнениеСинхронизацииВДлительнойОперации()
	
	НаименованиеФоновогоЗадания = НСтр("ru = 'Выполнение синхронизации данных';
								|en = 'Data synchronization'");
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеФоновогоЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ВыключитьПривилегированныйРежим = Ложь;
	Если ПривилегированныйРежим() = Ложь Тогда
		УстановитьПривилегированныйРежим(Истина);
		ВыключитьПривилегированныйРежим = Истина;
	КонецЕсли;
	СвойстваПоследнегоФоновогоЗадания =
			МС_СинхронизацияСервер.СвойстваПоследнегоФоновогоЗаданияВыполненияРегламентногоЗадания(ПараметрыЗагрузки);
	Если ВыключитьПривилегированныйРежим = Истина Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли; 
	
	Если СвойстваПоследнегоФоновогоЗадания <> Неопределено Тогда
				
		Если СвойстваПоследнегоФоновогоЗадания.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			
			ТекстСообщения = "Задание синхронизации уже выполняется. Запуск нового задания невозможен.";
			
			Результат = Новый Структура;
			Результат.Вставить("Статус",    "Ошибка");
			Результат.Вставить("ИдентификаторЗадания", Неопределено);
			Результат.Вставить("КраткоеПредставлениеОшибки", ТекстСообщения);
			Результат.Вставить("ПодробноеПредставлениеОшибки", ТекстСообщения);
			Результат.Вставить("Сообщения", Новый ФиксированныйМассив(Новый Массив));
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
			Возврат Результат;
		КонецЕсли;
		
		ПараметрыВыполнения.КлючФоновогоЗадания = СвойстваПоследнегоФоновогоЗадания.ИдентификаторРегламентногоЗадания;
		
	КонецЕсли;

	ИмяМетода = ?(ЗначениеЗаполнено(ПараметрыЗагрузки.НастройкаСинхронизации), 
					"МС_СинхронизацияСервер.ОбработкаКомандыСинхронизации", 
					"МС_СинхронизацияСервер.ВыполнитьСинхронизациюИзФормы");
	
	Результат = ДлительныеОперации.ВыполнитьВФоне(ИмяМетода, ПараметрыЗагрузки, ПараметрыВыполнения);
	
	ИдентификаторЗадания = Результат.ИдентификаторЗадания;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СинхронизацияЗавершение(Параметры, ДопПараметры) Экспорт
	
	Если Открыта() Тогда
		ПараметрЗакрытия = Новый Структура("РежимЗавершения, ИдентификаторЗадания", "ЗавершениеСинхронизации", ИдентификаторЗадания);
		
		ИдентификаторЗадания = Неопределено;
		
		Закрыть(ПараметрЗакрытия);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыЗагрузки = Новый Структура("НомерСтрокиНастройки, КодНастройки, ИмяФормы, НастройкаСинхронизации, МассивСсылок");
	ЗаполнитьЗначенияСвойств(ПараметрыЗагрузки, Параметры);
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗавершениеРаботы Тогда
	
		Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда 
			
			Отказ = Истина;
			
			ТекстВопроса = НСтр("ru = 'Оменить выполнение синхронизации?'; en = 'Cancel the synchronization?'");
			
			Оповещение = Новый ОписаниеОповещения("ВопросПрерватьСинхронизацию", ЭтотОбъект);
			
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПрерватьСинхронизацию(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		ОтменитьВыполняемуюСинхронизацию();
		ПараметрЗакрытия = Новый Структура("РежимЗавершения, ИдентификаторЗадания", "ПрерваноПользователем", ИдентификаторЗадания);
		ИдентификаторЗадания = Неопределено;
		Закрыть(ПараметрЗакрытия);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьВыполняемуюСинхронизацию()
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	
КонецПроцедуры
