
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрыВыполненияКоманды.Источник.Модифицированность Тогда
		Сообщить("Перед выполнением обмена необходимо сохранить настройки");
		Возврат;
	КонецЕсли; 
	
	Для каждого НастройкаСинхронизацииСсылка Из ПараметрКоманды Цикл
		
		ПараметрыЗагрузки = Новый Структура;
		ПараметрыЗагрузки.Вставить("НастройкаСинхронизации", НастройкаСинхронизацииСсылка);
		
		МС_СинхронизацияКлиент.ВыполнитьОбменДаннымиОбработкаКоманды(ПараметрыЗагрузки, ПараметрыВыполненияКоманды.Источник);
		
	КонецЦикла;
	
КонецПроцедуры