
Процедура ВыполнитьОбменДаннымиОбработкаКоманды(ПараметрыФормы, Владелец) Экспорт
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеВыполненияКомандыОбмена", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.МС_НастройкиСинхронизации.Форма.ФормаСинхронизации",
		ПараметрыФормы, Владелец, Владелец.УникальныйИдентификатор, , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ВыполнитьИнтерактивныйОбменДаннымиОбработкаКоманды(ПараметрыФормы, Владелец) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Владелец", Владелец);
	ДополнительныеПараметры.Вставить("СтруктураКомандыСинхронизации", ПараметрыФормы);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеВыполненияКомандыОбмена", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("ОбщаяФорма.МС_ФормаЗагрузкиИзТабличногоДокумента",
		ПараметрыФормы, Владелец, Владелец.УникальныйИдентификатор, , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ПослеВыполненияКомандыОбмена(Результат, ДопПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура")
		И Результат.Свойство("ЗаполнениеПоСопоставленнымДанным") = Истина Тогда
		
		// Обработка интерактивной загрузки
		
	Иначе	
		МС_СинхронизацияСервер.ВывестиСообщенияФоновогоЗадания(Результат);
	КонецЕсли; 
	
КонецПроцедуры

