
&После("ВыполнитьОбработкуПоРегламентномуЗаданию")
Процедура МС_ВыполнитьОбработкуПоРегламентномуЗаданию(ВнешняяОбработка, ИдентификаторКоманды)
	
	Если Не ТипЗнч(ВнешняяОбработка) = Тип("СправочникСсылка.МС_НастройкиСинхронизации") Тогда
		Возврат;
	КонецЕсли; 
	
	// Запись журнала регистрации
	ЗаписатьИнформацию(ВнешняяОбработка, 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Регламентное задание расширения %1: Запуск.'"), Строка(ВнешняяОбработка)));
	
	// Выполнение команды
	Попытка
		Выполнить(ИдентификаторКоманды);
	Исключение
		ЗаписатьОшибку(
			ВнешняяОбработка,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Регламентное задание расширения %1: Ошибка выполнения:
				|%2'"),
				ИдентификаторКоманды, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
	КонецПопытки;
	
КонецПроцедуры
