#Область ПоВерсииИШаблону

Функция ПоВерсииИШаблонуGETЗапрос(Запрос)
	Возврат МС_HTTPAPIСервер.ОбработатьЗапрос(Запрос);
КонецФункции

Функция ПоВерсииИШаблонуPOSTЗапрос(Запрос)
	Возврат МС_HTTPAPIСервер.ОбработатьЗапрос(Запрос);
КонецФункции

Функция ПоВерсииИШаблонуPUTЗапрос(Запрос)
	Возврат МС_HTTPAPIСервер.ОбработатьЗапрос(Запрос);
КонецФункции

Функция ПоВерсииИШаблонуDELETEЗапрос(Запрос)
	Возврат МС_HTTPAPIСервер.ОбработатьЗапрос(Запрос);
КонецФункции

Функция ПоВерсииИШаблонуPATCHЗапрос(Запрос)
	Возврат МС_HTTPAPIСервер.ОбработатьЗапрос(Запрос);
КонецФункции

Функция ПоВерсииИШаблонуHEADЗапрос(Запрос)
	Возврат МС_HTTPAPIСервер.ОбработатьЗапрос(Запрос);
КонецФункции

Функция ПоВерсииИШаблонуOPTIONSЗапрос(Запрос)
	Возврат МС_HTTPAPIСервер.ОбработатьЗапрос(Запрос);
КонецФункции

#КонецОбласти
