#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьСоединение(НастройкаПодключенияСсылка) Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Соединение", Неопределено);
	СтруктураВозврата.Вставить("СтрокаОшибок", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Пароль КАК Пароль,
	|	*
	|ИЗ
	|	Справочник.МС_НастройкиПодключений КАК МС_НастройкиПодключений
	|ГДЕ
	|	МС_НастройкиПодключений.Ссылка = &НастройкаПодключенияСсылка";
	
	Запрос.УстановитьПараметр("НастройкаПодключенияСсылка", НастройкаПодключенияСсылка);
	УстановитьПривилегированныйРежим(Истина);
	Запрос.УстановитьПараметр("Пароль", ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Строка(НастройкаПодключенияСсылка.УникальныйИдентификатор()), "Пароль"));
	УстановитьПривилегированныйРежим(Ложь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		СтруктураВозврата.СтрокаОшибок = "В базе отстутствует ссылка на настройку подключения";
		Возврат СтруктураВозврата;
	Иначе
		НастройкаПодключения = РезультатЗапроса.Выбрать();
		НастройкаПодключения.Следующий();
	КонецЕсли; 
	
	Попытка
		
		СтрокаПодключения = Вычислить(НастройкаПодключения.СтрокаПодключения);
		
		// Стандартная переменная, есть всегда
		Соединение = Неопределено;
		
		Выполнить(НастройкаПодключения.КодПодключения);

		Выполнить("СтруктураВозврата.Соединение = Соединение;");
		
	Исключение
		
		СтруктураВозврата.СтрокаОшибок = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат СтруктураВозврата;
	
КонецФункции
 
#КонецЕсли
